_sdaiCreateRepositoryFromFile(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Creates a new repository inside current session.
\param session [in] session instance
\param fileName [in] file name
\param name [in] repository name
\remarks If the name is empty (""), the
fileName becomes a newly created repository name. If the file stores several data section
(file_description.implementation_level is "3" or higher), every model gets the name
predefined in file, otherwise (file_description.implementation_level is 2 ("2;1", "2;2"),
the single model will have name "default".
\returns instance of the created repository, in other case NULL